Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་དཔག་ཏུ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དཔག་ཏུ་མེད་པ་དང་། ཤེས་རབ་དཔག་ཏུ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བ་དཔག་ཏུ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དཔག་ཏུ་མེད་པའི་ཕྱིར་རོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་ཇི་ཙམ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་འོད་ཏུ་བཏག་ས་པ་གདགས་པས་བཏགས་པ་དེ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་བརྒྱ་ཡི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ། ། དེ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤཱ་རིའི་བུ་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་ནང་དུ་གསེར་ཐ་མལ་པ་གཞག་ན་སྣག་ཚའི་གར་བུ་བཞིན་དུ་འགྱུར་ཏེ་ལམ་མེར་མི་འགྱུར། ལྷན་ནེར་མི་འགྱུར། ལྷང་ངེར་མི་འགྱུར་རོ། ། དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་འོད་ཏུ་གདགས་པས་བཏགས་པ་ཇི་སྙེད་ཡོད་པ་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་མདུན་ན་ལམ་མེར་མི་འགྱུར། ལྷན་ནེར་མི་འགྱུར། ལྷང་ངེར་མི་འགྱུར་རོ། ། འོད་གསལ་བར་མི་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པའི་འོད་ནི་དེ་དག་གི་ནང་ན་མཆོག་ཅེས་བྱ། དམ་པ་ཞེས་བྱ། བླ་ན་མེད་པ་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་ཉི་ཚེ་བའི་འོད་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་མངོན་པར་གྲུབ་པའི་འོད་དེས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བས་ཤིན་ཏུ་ཁྱབ་པར་འགྱུར་ཏེ
en: “Why is this? Śāriputra, it is because of the Tathāgata’s immeasurable morality, his immeasurable concentration, his immeasurable wisdom, his immeasurable liberation, and his immeasurable insight into the knowledge of liberation. These are so great, Śāriputra, that if one were to experience all the radiance that could possibly be perceived in the threefold thousand great thousand worlds, then that would not even approach a hundredth part of the radiance of the Tathāgata. It would not even come close. For example, Śāriputra, if one puts ordinary gold next to the gold of the Jambu River, it will look like pieces of soot and will not shine, glow, or radiate light. Likewise, Śāriputra, however much visible radiance could be perceived in the threefold thousand great thousand worlds, it will not shine, glow, or radiate in the presence of the radiance of the Tathāgata. It will not be brilliant, and this is why the radiance of the Tathāgata is said to be better, superior, and supreme in comparison. Śāriputra, if you take even a minuscule amount of the radiance that stems from the ripening of the fruits of the Tathāgata’s previous actions, this radiance will illuminate the threefold thousand great thousand worlds fully.

source: ཤཱ་རིའི་བུ་ཟླ་བ་དང་ཉི་མའི་འོད་ཀྱིས་སྣང་བ་ཡང་མི་འབྱུང་། ཉིན་མོར་ཡང་མི་ཤེས། མཚན་མོར་ཡང་མི་ཤེས། ཟླ་བ་ཕྱེད་དང་། ཟླ་བ་གཅིག་པར་ཡང་མི་ཤེས། དུས་དང་ལོར་ཡང་མི་ཤེས་མོད་ཀྱི། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་འོད་འདོམ་གང་ཙམ་དུ་བྱིན་གྱིས་རློབ་སྟེ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞེད་ན་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་འོད་ཀྱིས་ཁྱབ་པར་མཛད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྙེས་པ་སྟེ། ཤཱ་རིའི་བུ་དོན་དེ་ཉིད་རབ་ཏུ་རྟོགས་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བསྟན་ཏོ། །
en: “However, Śāriputra, without the radiance of the sun and the moon, one would be ignorant of night and day, one would be ignorant of the full moon and the new moon, and one would be ignorant of days and years. Out of concern for the welfare of sentient beings, the Tathāgata therefore emanates an aura measuring six feet. And, Śāriputra, the tathāgata, arhat, fully accomplished Buddha does this because he wishes to illuminate innumerable worlds. Why does he wish to do this? It is because, Śāriputra, the Tathāgata has attained the highest perfection, the perfection of wisdom.

source: ཤཱ་རིའི་བུ་སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཇི་སྙེད་པ་ཐམས་ཅད་རྡུལ་ཕྲ་རབ་ཏུ་བྱས་ནས་རྡུལ་དེ་དག་ཐུ་བར་བླུགས་ཏེ། ཤར་ཕྱོགས་སུ་སོང་ནས་རྡུལ་ཕྲ་མོ་དེ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདས་ནས། རྡུལ་ཕྲ་རབ་གཉིས་པ་བོར་ཞིང་ཤར་ཕྱོགས་སུ་སོང་ན། ཤཱ་རིའི་བུ་རྡུལ་ཕྲ་རབ་དེ་ཐམས་ཅད་ནི་ཟད་པར་འགྱུར་གྱིས། ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ནི་ཟད་པ་མེད་དོ། ། དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་ནས་ཕྱོགས་བཅུ་ཀུན་གྱི་བར་དུའོ། །ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་མཐའ་དང་། མུ་གཟུང་བར་ནུས་སམ།
en: “Śāriputra, I will give you an example so that you might appreciate this more fully. Imagine that a certain person took all the particles in the threefold thousand great thousand worlds and divided them into individual atoms, and that he then gathered these atoms together and headed east. Imagine that he traversed as many worlds as there are atoms, leaving behind an atom in each. Śāriputra, he could use up all these atoms while still heading east. There is no end to the worlds to the east, and similarly there is no end to the worlds to the south, to the west, to the north, and in all ten directions. What do you think, Śāriputra? Is it possible to find an end or a limit to these worlds?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་མི་ནུས་སོ། །བདེ་བར་གཤེགས་པ་དེ་མི་ནུས་སོ། །
en: “Certainly not, Lord. Certainly not, Sugata.”

source: བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞེད་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་འོད་ཀྱིས་ཁྱབ་པར་མཛད་དེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་ཇི་ཙམ་འོད་ཏུ་བཏགས་པ་གདགས་པས་བཏགས་པ་དེ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་མདུན་ན་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དེ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Śāriputra, it is the intention of the Tathāgata, the Arhat, the fully accomplished Buddha to extend his radiance through all these worlds. If one were to experience all the radiance that could possibly be perceived in these worlds, it would not even approach a hundredth part of the radiance of the Tathāgata. It would not even come close. Śāriputra, this is because the tathāgata, arhat, fully accomplished Buddha has attained the highest perfection, the perfection of wisdom.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་འོད་ལ་ནི་རྩིག་པ་འམ། ཤིང་ངམ། ལྗོན་པའམ། ཁོར་ཡུག་གི་རི་འམ། ཁོར་ཡུག་ཆེན་པོའམ། རི་སྤོས་ཀྱི་ངད་ལྡང་ངམ། རི་བཏང་བཟུང་ངམ། རི་བཏང་བཟུང་ཆེན་པོའམ། གངས་རི་འམ། རི་གཉའ་ཤིང་འཛིན་ཏམ། དེ་མ་ཡིན་པ་གཞན་རི་ན་ནག་པོ་འམ། རིའི་རྒྱལ་པོ་རི་རབ་དང་། གང་གིས་ཀྱང་སྒྲིབ་པར་མི་ནུས་ཏེ དེ་དག་ཐམས་ཅད་ལས་ཐལ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁྱབ་པར་བྱས་ཀྱང་དམན་པ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་མོས་པར་མི་འགྱུར་ཏེ། དེ་ལ་སེམས་ཅན་ལ་ལས་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་འདོམ་གང་ཙམ་དུ་མཐོང་ངོ་། ། གང་དེ་བས་རྒྱ་ཆེ་བ་དེ་དག་གིས་ནི་འོད་འདོམ་དོ་ཙམ་དུ་མཐོང་ངོ་། ། གང་དེ་བས་ཤིན་ཏུ་རྒྱ་ཆེ་བ་དེ་དག་གིས་ནི་འོད་རྒྱང་གྲགས་ཙམ་དུ་མཐོང་བ་ནས་གང་དེ་བས་ཀྱང་ཤིན་ཏུ་རྒྱ་ཆེན་པོས་ནི་འོད་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཙམ་གྱི་བར་དུ་མཐོང་སྟེ
en: “Now, Śāriputra, nothing can cast a shadow over the Tathāgata’s aura—not a wall, a piece of wood, a tree, the Cakravāḍa Mountains, the Mahācakravāḍa Mountains, Mount Gandhamādana, Mount Mucilinda, Mount Mahāmucilinda, Mount Himavat, Mount Īśādhāra, any other mountains such as the Black Mountains, or Sumeru, the king of mountains. None can cast a shadow over the Tathāgata’s aura. It passes through them all and spreads throughout the threefold thousand great thousand worlds. Still, there are sentient beings with inferior inclination who might not be able to see it. Some perceive the Tathāgata’s aura as measuring six feet. Great beings perceive the Tathāgata’s aura as measuring twelve feet. Superior beings perceive the Tathāgata’s aura as measuring one krośa. Supreme beings perceive the Tathāgata’s aura as extending throughout the threefold thousand great thousand worlds.

source: དེ་ལྟར་ན་ཤཱ་རིའི་བུ་སྟོང་ཕྲག་བརྒྱ་པའི་ཚངས་པས་ནི་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་ཕྲག་བརྒྱའི་བར་དུ་འོད་ཀྱིས་ཁྱབ་པར་མཐོང་སྟེ་རྒྱས་པར་བྱའོ། ། ས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པའི་བར་དུ་ཁྱབ་པར་མཐོང་ངོ་། ། དེ་ལྟར་ཤཱ་རིའི་བུ་ནམ་མཁའི་ཁམས་ཇི་ཙམ་པ་སེམས་ཅན་གྱི་ཁམས་ཀྱང་དེ་ཙམ་སྟེ། དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་དེ་ཙམ་དུ་འོད་ཀྱིས་ཁྱབ་པར་མཛད་དོ། ། དེ་བྱང་ཆུབ་སེམས་དཔས་ཐོས་ནས་ཐེ་ཚོམ་མེད། སོམ་ཉི་མི་ཟ། མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: Likewise, Śāriputra, the Brahmā of the one hundred thousand perceives the aura as extending throughout the universe of the one hundred thousand, and so forth. The bodhisatvas who have attained the higher stages of development perceive the Tathāgata’s aura as extending throughout the limitless universe. Śāriputra, because of his concern for the welfare of sentient beings, the radiance of the Tathāgata will extend wherever space exists and wherever there are sentient beings. The bodhisatva who hears this has great faith in it, has trust and confidence, and does not doubt it, and to an even greater degree he feels pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary.”

source: ཉི་མ་ཟླ་བའི་འོད་གང་དང་། །བརྒྱ་བྱིན་ཚངས་འོད་གང་ཡོད་དང་། །འོག་མིན་བར་གྱི་འོད་རྣམས་ཀྱིས། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །
en: “The light of the moon and the sun, The light of Śakra and Brahmā, Even the radiance of the Heaven of Nothing Higher— These are not worth even a sixteenth.

source: འོག་མིན་གྱི་ནི་འོད་རྣམས་དང་། །གང་རྣམས་སྟོང་གསུམ་ཁྱབ་གྱུར་པས། །སངས་རྒྱས་སྤུའི་འོད་ཟེར་གྱི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །
en: “Though the radiance of the Heaven of Nothing Higher Spread throughout the three-thousandfold worlds, It would not match even a sixteenth of the brilliance Of a single hair on the Buddha’s body.

source: ནམ་མཁའ་དག་ནི་ཇི་ཙམ་པར། །དེ་ཙམ་འོད་ཀྱིས་ཁྱབ་བྱེད་པ། །བློ་གྲོས་རྒྱ་ཆེན་སེམས་ཅན་གྱིས། །དེ་འདྲ་བར་ནི་འོད་མཐོང་ངོ་། །
en: “Wherever space exists, His aura may be seen. This is the aura as it appears To noble-minded beings.

source: སངས་རྒྱས་འོད་ནི་མཐའ་ཡས་ཏེ། །
en: “The Buddha’s aura is limitless,

source: ནམ་མཁའ་དག་ནི་མཚུངས་མཉམ་པ། །ཇི་ལྟར་འདུལ་བར་འགྱུར་རྣམས་ཀྱིས། །དེ་འདྲ་བར་ནི་འོད་མཐོང་ངོ་། །
en: Equal to the sky in its scope. Such is the aura as it appears To those in training.

source: ཇི་ལྟར་སྐྱེས་བུ་དམུས་ལོང་གིས། །ཉི་མའི་འོད་ནི་དེ་འདྲ་བར། །མ་མཐོང་བས་ནི་འོད་དེ་ལ། །འོད་ནི་ཡོད་པ་མིན་ཞེས་སྨྲ། །
en: “A person blind from birth, Who is unable to see the light of the sun, Will say that its light Does not exist.

source: དེ་བཞིན་སེམས་ཅན་དམན་པ་གང་། རྒྱལ་བའི་འོད་ནི་མི་མཐོང་སྟེ། ། མ་མཐོང་བས་ན་རྒྱལ་བ་ཡི། །འོད་ནི་ཡོད་པ་མིན་ཞེས་ཟེར། །
en: “Likewise, beings whose inclination is inferior Do not see the aura of the Victorious One, And thus they will say That the Victorious One’s aura does not exist.

source: ལ་ལས་འདོམ་དོ་ཙམ་དུ་མཐོང་། །ལ་ལས་རྒྱང་གྲགས་དཔག་ཚད་དང་། ལ་ལས་སྟོང་གསུམ་ཐམས་ཅད་དུ། །འོད་ཀྱིས་ཁྱབ་པར་གྱུར་པ་མཐོང་། །
en: “Some perceive it as extending twelve feet, Some one yojana, some eight yojanas, And some as pervading the whole three-thousandfold world— This is how the extent of his radiance is perceived.

source: ས་བརྒྱད་པ་དང་དགུ་པ་དང་། །བཅུ་པ་ལ་ནི་གང་གནས་པ། །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཆེ། །ས་ཆེན་ལ་ནི་གང་གནས་པ། །
en: “Those who dwell on the eighth, On the ninth, or on the tenth stage Are bodhisatvas of great wisdom—They are on the great stages.

source: དེ་དག་སངས་རྒྱས་རྣམས་ཀྱི་འོད། །མཐའ་ཡས་དཀྱིལ་འཁོར་འཇུག་བྱེད་ཅིང་། །བསམ་ཡས་སངས་རྒྱས་ཞིང་རྣམས་སུ། །སངས་རྒྱས་དག་གི་བྱ་བ་བྱེད། །
en: “They emerge from the maṇḍala Of the limitless aura of the Buddha. They engage in buddha activity In the inconceivable buddha realms.

source: དེ་ལྟར་སངས་རྒྱས་བསམ་ཡས་ཏེ། །
en: “Thus are the buddhas inconceivable,

source: སངས་རྒྱས་འོད་ཟེར་བསམ་མི་ཁྱབ། །
en: And their buddha splendor is inconceivable.

source: བསམ་མི་ཁྱབ་ལ་དད་བྱས་ན། །
en: Having faith in these inconceivable qualities

source: བསོད་ནམས་ཕུང་པོ་བསམ་མི་ཁྱབ། །
en: Brings inconceivable merit.

source: ཡང་ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རང་ས་པ་རྙེད་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་པ་ནས་ངོ་མཚར་དང་རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན།
en: “Śāriputra, what is it about the Tathāgata’s inconceivable tathāgata morality that leads the bodhisatva to have faith in it? What is it that leads the bodhisatva to trust and have confidence in it and not to doubt? What is it that leads him to an even greater degree to feel pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary? And what is it about the Tathāgata’s inconceivable concentration that leads the bodhisatva to have faith in it? What is it that leads the bodhisatva to trust and have confidence in it, and so on, as he produces the concept of it as being truly wondrous and extraordinary?

source: ཤཱ་རིའི་བུ་འདི་ལྟར་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་སེམས་ཅན་འཇིག་རྟེན་དུ་བྱུང་སྟེ། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་ལྡན་པ། ངག་གི་ལས་ཡོངས་སུ་དག་པ་དང་ལྡན་པ། ཡིད་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་འཇིག་རྟེན་དུ་བྱུང་ཞིང་སྐྱེས་ནས་ འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མ་གོས་པ། བྲམ་ཟེ་སྡིག་པ་སྤངས་པ། དགེ་སྦྱོང་ཞི་བ། བསམ་གཏན་པའི་མཆོག །ཏིང་ངེ་འཛིན་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་སེམས་ཅན་འཇིག་རྟེན་དུ་བྱུང་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཡིན་པར་ཡང་དག་པར་སྨྲ་བས་སྨྲའོ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Śāriputra, take for instance those who engage in right speech. Someone like that is born into the world as a being of completely pure morality. He is born and grows up in the world as someone who possesses completely pure physical conduct, completely pure verbal conduct, and completely pure mental conduct. He will not be tainted by worldly customs. He will be a brahmin who has abandoned evil actions. He will be a tranquil ascetic. He will excel in meditation. He will be born into the world as a being who attains the highest perfection of concentration. The Tathāgata is truly someone who engages in right speech. How so?

source: ཤཱ་རིའི་བུ་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། ཚངས་པར་བཅས་པ་དང་། བདུད་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དུ་བཅས་པ་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ན་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྟར་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ། ཚད་མེད་པ་དེ་ལྟ་བུ་ངས་མ་མཐོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའོ། །
en: Śāriputra, I have not seen anyone in the world with its gods, brahmās, māras, ascetics, and brahmins, the world with its gods, humans, and asuras, whose morality and concentration are completely pure and immeasurable like that of the tathāgata, the arhat, the fully accomplished Buddha. Why should this be the case? It is because the Tathāgata has attained the highest possible degree of perfection in the perfections of morality and concentration.

source: ཤཱ་རིའི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་ཚད་མེད་པའི་དཔེ་ཙམ་ཉན་པར་འདོད་དམ།
en: “Śāriputra, would you like to hear a simile as an example related to the Tathāgata’s perfection of morality and concentration?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟར་དགེ་སློང་དག་ལ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ དཔེ་ཙམ་བཤད་ན་བཅོམ་ལྡན་འདས་ལས་ཇི་ལྟར་ཐོས་པ་དེ་བཞིན་དུ་འཛིན་པར་འགྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེའི་དུས་ནི་འདི་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེའི་དུས་ནི་འདི་ལགས་སོ།
en: He answered, “This time, Lord, this is an occasion, Sugata, for you to provide a simile as an example concerning the Tathāgata’s attainment of perfection in morality and concentration, so that the mendicants listening to the Lord will grasp the essence of things.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་གྱི་ཁམས་དང་སའི་ཁམས་གང་མང་།
en: The Lord asked, “In your opinion, Śāriputra, which is larger: the element of sentient beings or the earth element?”

source: གསོལ་པ། ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན་བཅོམ་ལྡན་འདས་སེམས་ཅན་གྱི་ཁམས་ནི་རབ་ཏུ་མང་གི་སའི་ཁམས་ནི་མ་ལགས་སོ། །
en: He answered, “From what I understand of what the Lord has said, the element of sentient beings, and not the earth element, is larger, Lord.”

source: བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་དེ་བཞིན་ཏེ། ཤཱ་རིའི་བུ་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་མང་གི་སའི་ཁམས་ནི་མ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་ཇི་སྙེད་སྒོ་ང་ལས་སྐྱེས་པའམ། མངལ་ནས་སྐྱེས་པ་འམ། དྲོད་གཤེར་ལས་སྐྱེས་པ་འམ། རྫུས་ཏེ་ སྐྱེས་པ་འམ། གཟུགས་ཅན་ནམ། གཟུགས་མེད་པ་འམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་སེམས་ཅན་རྣམས་ཇི་ཙམ་དུ་སེམས་ཅན་དུ་གདགས་པས་བཏགས་པ་དེ་ཐམས་ཅད་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་གིས་སྔ་ཕྱི་མེད་པར་མི་ཡི་ལུས་ཐོབ་པར་གྱུར་ལ། ཤཱ་རིའི་བུ་མིར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་གིས་སྔ་ཕྱི་མེད་པར་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཅིང་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། དེ་བཞིན་གཤེགས་པ་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་མངོན་པར་སྤྲུལ་ཏེ། དེ་བཞིན་གཤེགས་པ་རེ་རེ་ལ་ཡང་དབུ་སྟོང་སྟོང་དུ་གྱུར། དབུ་རེ་རེ་ལ་ཡང་ཞལ་སྟོང་སྟོང་དུ་གྱུར། ཞལ་རེ་རེ་ལ་ཡང་ལྗགས་སྟོང་སྟོང་དུ་གྱུར་ལ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་སྟོབས་བཅུ་དང་ལྡན་པར་གྱུར། མི་འཇིགས་པ་བཞི་དང་། དེ་བཞིན་གཤེགས་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། ཆགས་པ་མེད་པ་སྒྲིབ་པ་མེད་པའི་སངས་རྒྱས་ཀྱི་སྤོབས་པ་དང་ལྡན་པར་གྱུར་ལ། །ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་གཅིག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་བསྔགས་པ་བརྗོད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ནི་དེ་འདྲ་སྟེ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་མི་ཟད། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཤེས་རབ་དང་། སྤོབས་པ་བླ་ན་མེད་པ་ཡང་མི་ཟད་དེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་དེའི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཤེས་རབ་དང་། སྤོབས་པ་བླ་ན་མེད་པ་དང་དེ་གཉིས་ནི་ཚད་མེད་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། ནམ་མཁའ་དང་མཉམ་ཞིང་མཚུངས་སོ། །
en: He then said, “Exactly, Śāriputra, exactly. The element of sentient beings, Śāriputra, and not the earth element, is larger. Śāriputra, however many sentient beings there may be in the threefold thousand great thousand worlds—those born from an egg, those born from a womb, those born from moisture, those born spontaneously, those with form, those without form, those with perception, those without perception, and those with neither perception nor nonperception—however extensive one takes the element of sentient beings to be, imagine that they all at some instant, at some point, at some time, sooner or later, will achieve a human existence. Furthermore, Śāriputra, imagine that all these sentient human beings will at some instant, at some point, at some time, sooner or later, attain unsurpassed perfect awakening. Each of them will be a tathāgata, and as many tathāgatas as there might then be, each of them will emanate that number of tathāgatas, and each tathāgata will have a thousand heads. Each head will have a thousand mouths. In each mouth there will be a thousand tongues. All these tathāgatas will possess the ten powers. They will possess the four kinds of confidence, the fourfold authentic knowledge of the tathāgatas, and the unrestrained unobstructed eloquence of buddhas. Śāriputra, for a thousand million billion eons these tathāgatas will praise the perfection of morality attained by a single tathāgata. Such is the morality of a tathāgata. Śāriputra, the morality of a tathāgata will not be exhausted, and the wisdom and eloquence of these tathāgatas will not be exhausted. All these tathāgatas will attain complete nirvāṇa during that period. Why is this? It is because both of these qualities, the morality of a tathāgata and these tathāgatas’ unsurpassed wisdom and eloquence, are inconceivable, inestimable, and immeasurable like the sky.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཞོག་ལ། །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན་སེམས་ཅན་ཇི་སྙེད་པ་དང་། དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་དང་། དེ་བཞིན་དུ་ཕྱོགས་མཚམས་དང་། །ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་གིས་མིའི་ལུས་ཐོབ་པར་གྱུར་པ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པའི་བར་དུ་གོང་མ་བཞིན་དུ་རྒྱས་པར་བྱ་སྟེ། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཤེས་རབ་དང་། སྤོབས་པ་བླ་ན་མེད་པ་དང་། དེ་གཉིས་ཚད་མེད་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ་ནམ་མཁའ་དང་མཉམ་ཞིང་མཚུངས་ཏེ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའོ། །
en: “And not only, Śāriputra, the sentient beings of the threefold thousand great thousand world but, Śāriputra, as many sentient beings as there are in the eastern direction, in worlds as numerous as the grains of sand in the river Ganges, and likewise in the southern, the western, and the northern directions, below, above, and in the intermediate directions, throughout all the ten directions, and in worlds as numerous as the grains of sand in the river Ganges will at some instant, at some point, at some time, achieve a human existence and attain unsurpassed perfect awakening—and so forth, as set out above. Both of these qualities—the morality of a tathāgata and the unsurpassed wisdom and eloquence of these lords, these buddhas—are inconceivable, inestimable, and immeasurable like the sky. Such indeed, Śāriputra, is the supreme perfection that the Tathāgata has attained in the perfection of morality.

source: ཤཱ་རིའི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དཔེ་ཙམ་དུ་བྱ་བ་ཉན་པར་འདོད་དམ།
en: “Śāriputra, would you like to hear an example related to the Tathāgata’s perfection of concentration?”

source: གསོལ་པ། འདི་ལྟར་དགེ་སློང་རྣམས་བཅོམ་ལྡན་འདས་ལས་ཐོས་ནས་ དེ་བཞིན་དུ་འཛིན་པར་འགྱུར་ཏེ་བཅོམ་ལྡན་འདས་དེའི་དུས་འདི་ལགས་སོ། བདེ་བར་གཤེགས་པ་དེའི་ཚོད་འདི་ལགས་སོ། །
en: He answered, “This is the time, Lord, this is the occasion, Sugata, for you to provide an example, so that the mendicants listening to the Lord will come to understand the way things are.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །ཤཱ་རིའི་བུ་དེའི་དུས་དེའི་ཚོད་འབྱུང་སྟེ། ཉི་མ་བདུན་འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར་བ་གཅིག་ཏུ་གྱུར་པ་དེའི་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བཅུ་དང་ལྡན་པར་འགྱུར་རོ། ། བཅུ་གང་ཞེ་ན། ས་ཕྱོགས་དེ་ལག་མཐིལ་ལྟར་མཉམ་པར་འགྱུར་ཏེ། ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་དང་པོ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: The Lord said, “There is an era, there is a time, when the world sees the appearance of seven suns, and the threefold thousand great thousand worlds burn, blaze, and flame up like a single mass of fire. Now, Śāriputra, in that world that has become a single mass of fire in this way, in that place, the Tathāgata will walk, stand, sit, and lie down, and that place will have ten wondrous and extraordinary properties. What are these ten qualities? That place will be like the palm of a hand. This is the first wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེ་གསེག་མ་དང་། གྱོ་མོ་མེད་ཅིང་མཐོ་བར་གྱུར་པའི་གཟུགས་སུ་འགྱུར་ཏེ ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་གཉིས་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. There will be no stones and gravel in that place, and it will consist of excellent gold. This is the second wondrous and extraordinary property that place will possess.
